# How to connect database with jupyter notebook/Python

In [ ]:
# All the queries from jupyter notebook will be executed in your database

In [ ]:
# Link to install mysql connector library
https://dev.mysql.com/downloads/connector/python/8.0.html

In [1]:
import mysql.connector as sql
import pandas as pd

In [ ]:
# Connect to database >> sql.connect function
# use_pure >> Whenever we set it as true, whatever changes you make in
# jupyter notebook that will get reflected in database

In [26]:
# Create connection
mydb=sql.connect(host='localhost',
           user='root',
           passwd='Pandurang26!',
           use_pure= True)
print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x000001836DA2EA00>

In [15]:
# To show list of databases 
mycursor= mydb.cursor()   # cursor is like pointer to a memory location. we have to create mycursor object.
mycursor.execute('show databases')    # my cursor execute function

for db in mycursor:                   # use for loop to print multiple databases
    print(db)

('db_april',)
('db_jan',)
('dec_weekdays',)
('information_schema',)
('mysql',)
('performance_schema',)

In [17]:
# Create new database 

mycursor.execute('create database db_april_new')

In [43]:
# To use database db_april
mydb=sql.connect(host='localhost',
           user='root',
           passwd='Pandurang26!',
           use_pure= True,
           database='db_april')
print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x000001836E0877C0>

In [36]:
# To show list of tables in  database db_april
mycursor= mydb.cursor()

mycursor.execute('show tables')
for tbl in mycursor:
    print(tbl)

('50_startups',)
('50_startups_5rows',)
('50_startups_cal',)
('airpassengers',)
('cars93',)
('cars93_1to5',)
('cars93_5to10',)
('cars93_price20',)
('course',)
('dept',)
('emp',)
('emp1',)
('emp2',)
('emp3',)
('emp_2',)
('emp_ai',)
('emp_chk',)
('emp_data',)
('emp_def',)
('emp_null',)
('emp_pri',)
('emp_uniq',)
('employee',)
('employee1',)
('inner_join',)
('student',)
('student1',)

In [39]:
# To use database db_april_new
mydb=sql.connect(host='localhost',
           user='root',
           passwd='Pandurang26!',
           use_pure= True,
           database='db_april_new')
print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x000001836DB916D0>

In [40]:
# To show list of tables in  database db_april_new
mycursor= mydb.cursor()

mycursor.execute('show tables')
for tbl in mycursor:
    print(tbl)

('emp1',)

In [41]:
# create a table in db_april_new
mycursor= mydb.cursor()

mycursor.execute('create table emp2(empid int)')

In [44]:
# To execute any query > use function read_sql_query function of pandas library 
# This function will convert database output(table data) into dataframe

mycursor= mydb.cursor()
df=pd.read_sql_query('select * from employee',mydb)
df

   emp_id first_name  salary location        joining_date department_name
0    1001      Mayur   50000   nashik 2014-12-11 09:00:00     Development
1    1002   Shrikant   60000     Pune 2014-12-11 09:00:00     Development
2    1003      Sagar  100000   Katraj 2014-12-12 09:00:00              HR
3    1004     Hemant   70000   Pimpri 2014-12-13 09:00:00              HR
4    1005      Suyog   65000    Wakad 2015-10-21 09:00:00      Accountant
5    1006     Sushil   50000  Nalstop 2015-10-15 09:00:00      Accountant
6    1007    Archana   50000  Kothrud 2031-03-23 09:00:00     Electronics

In [ ]:
# syntax for read_sql_query (query,connection_name)

In [45]:
df=pd.read_sql_query('select * from employee where salary>50000',mydb)
df

   emp_id first_name  salary location        joining_date department_name
0    1002   Shrikant   60000     Pune 2014-12-11 09:00:00     Development
1    1003      Sagar  100000   Katraj 2014-12-12 09:00:00              HR
2    1004     Hemant   70000   Pimpri 2014-12-13 09:00:00              HR
3    1005      Suyog   65000    Wakad 2015-10-21 09:00:00      Accountant

In [47]:
df=pd.read_sql_query('select Type from cars93',mydb)
df

       Type
0     Small
1   Midsize
2   Compact
3   Midsize
4   Midsize
..      ...
77    Small
78  Compact
79   Sporty
80  Compact
81  Midsize

[82 rows x 1 columns]

In [50]:
df=pd.read_sql_query('select price,type from cars93 order by price desc',mydb)
df

    price     type
0    61.9  Midsize
1    47.9  Midsize
2    40.1  Midsize
3    37.7  Midsize
4    36.1    Large
..    ...      ...
77    8.4    Small
78    8.4    Small
79    8.3    Small
80    8.0    Small
81    7.4    Small

[82 rows x 2 columns]

In [54]:
# To use database db_april
mydb=sql.connect(host='localhost',
           user='root',
           passwd='Pandurang26!',
           use_pure= True,
           database='db_april_new')
print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x000001836E17A220>

In [55]:
df=pd.read_sql_query('select * from emp1',mydb)
df

   empid
0   1001
1   1002